Files/Teoria/DataStruct/LinkedLists.org
* Linked lists

** Singly & Doubly Linked Lists
*** ¿Que es una lista enlazada (linked list)?
Una lista enlazada es una lista sequencial de nodos que tienen datos que
apuntan a otros nodos que también contienen datos.

TODO: arreglar diagramas
#+begin_example
  graph LR
      id1([Data]) --> id2([Data]) --> id3([Data]) --> id4([Data]) --> id5([Null]) 
#+end_example

*** ¿Donde son usadas?

- Mayoritariamente en listas, colas & pilas.
- Para crear listas circulares.
- Pueden modelar objetos del mundo real como trenes.
- Usadas en encadenamiento separado (/Separate chaining/), que están
  presentes en en algunas implementaciónes de de tablas hash para evitar
  las colisiones hash.
- Usadas a veces en la implementación de listas de proximidad para
  grafos.

*** Terminologia
*** Singliy linked vs. Doubly Linked
Con Singly linked nos referimos a que cada nodo solo tiene una
referencia al siguiente nodo. En la implementación siempre se mantiene
una referencia de la Head y de la Tail para hacer más rápido el agregar
o remover elementos.

#+begin_example
  graph LR 
      3-->84-->85-->21-->29-->44-->30
#+end_example

Con una Doubly linked list, cada nodo mantiene una referencia al
siguiente y al nodo anterior. En la implementación siempre se mantiene
una referencia a Head y Tail de toda la lista para hacer más rápido el
agregar o remover elementos de ambos lados de la lista.

#+begin_example
  flowchart LR 
      3 <--> 84
      84 <--> 85
      85 <--> 21
      21 <--> 29
      29 <--> 44<-->30
#+end_example

*** Pros and Cons
|               | Pros                                        | Cons                                       |
|---------------+---------------------------------------------+--------------------------------------------|
| Singly Linked | Usa menos menoria Implementación más simple | No puedes ver fácilmente elementos previos |
| Doubly Linked | Puede ser invertida                         | Ocupa el doble de memoria                  |

** Detalles de implementación
*** Insertando en una Singly linked list
Inserta 11 en el tercer nodo.

#+begin_example
  flowchart LR
      id1((5)) --> id2((23)) --> id3((7)) --> id4((13))
#+end_example

1. Creamos un puntero que apunte a Head
2. Nos posicionamos en un nodo anterior al que queremos cambiar
3. Creamos un nuevo nodo que apunte a el nodo que queremos reemplazar
4. hacemos que el nodo en que estamos posicionados apunte al nuevo nodo.

#+begin_example
  graph LR
      subgraph new
      11-->id4((7))
      end 
      id0((5))-->id1((23))-->11
      id4((7))-->id5((13))
#+end_example

*** Insertando en una Doubly linked list
Inserta 11 en el tercer nodo.

#+begin_example
  flowchart LR
      id1((5)) <--> id2((23)) <--> id3((7)) <--> id4((13))
#+end_example

1. Creamos un puntero que apunte a Head
2. Nos posicionamos en un nodo anterior al que queremos cambiar
3. Creamos un nuevo nodo que apunte al nodo al que queremos remplazar
4. hacemos que el nuevo nodo apunte al siguiente nodo que queremos
   remplazar
5. hacemos que el nuevo nodo apunte al nodo anterior
6. Hacemos que el nodo sigiente al que insertamos apunte hacia el nuevo
   nodo

*** Eliminando elementos de una Singly linked list
Elimina el 9 de la siguiente SSL

#+begin_example
  flowchart LR
      id1((7)) --> id2((0)) --> id3((4)) --> id4((9)) --> id5((15))
#+end_example

1. Creamos dos punteros

#+begin_example
  flowchart LR
      subgraph p1
      id1((7))
      end
      subgraph p2
      id2((0))
      end
      id1((7)) --> id2((0)) --> id3((4)) --> id4((9)) --> id5((15))
#+end_example

Hacemos avanzar nuestros dos punteros hasta una posicion anterior al
nodo que queremos eliminar.

#+begin_example
  flowchart LR
      subgraph p1
      id2((0))
      end
      subgraph p2
      id3((4))
      end
      id1((7)) --> id2((0)) --> id3((4)) --> id4((9)) --> id5((15))
#+end_example

Hacemos avanzar el Puntero 2 a un lugar despues de el nodo que queremos
eliminar y el Puntero 1 a un lugar antes.

#+begin_example
  flowchart LR
      subgraph p1
      id3((4))
      end
      subgraph p2
      id5((15))
      end
      id1((7)) --> id2((0)) --> id3((4)) --> id4((9)) --> id5((15))
#+end_example

Cambiamos el puntero de nodo siguiente a la posición del puntero 2

#+begin_example
  flowchart LR
      subgraph p1
      id3((4))
      end
      subgraph p2
      id5((15))
      end
      id1((7)) --> id2((0)) --> id3((4)) --> id5((15))
      id4((9)) --> id5((15))
#+end_example

entonces eliminamos el nodo que queremos eliminar

#+begin_example
  flowchart LR
      subgraph p1
      id3((4))
      end
      subgraph p2
      id5((15))
      end
      id1((7)) --> id2((0)) --> id3((4)) --> id5((15))
#+end_example

*** Eliminar elementos de una Doubly linked list
Elimina el elemento 9 de la siguiente DDL

#+begin_example
  flowchart LR
      id1((7)) <--> id2((0)) <--> id3((4)) <--> id4((9)) <--> id5((15))
#+end_example

Creamos nuestro puntero en head.

#+begin_example
  flowchart LR
      subgraph P1
      id1
      end
      id1((7)) <--> id2((0)) <--> id3((4)) <--> id4((9)) <--> id5((15))
#+end_example

lo movemos hasta que lleguemos al nodo que se desea eliminar.

#+begin_example
  flowchart LR
      subgraph P1
      id4
      end
      id1((7)) <--> id2((0)) <--> id3((4)) <--> id4((9)) <--> id5((15))
#+end_example

Hacemos que el nodo anterior apunte al nodo que le sigue al que queremos
eliminar.

#+begin_example
  flowchart LR
      subgraph P1
      id4
      end
      id1((7)) <--> id2((0)) <--> id3((4)) <--> id4((9)) <--> id5((15))
      id3 --> id5
#+end_example

Luego hacemos que el puntero de 15 apunte a 4.

#+begin_example
  flowchart LR
      subgraph P1
      id4
      end
      id1((7)) <--> id2((0)) <--> id3((4)) <--> id4((9)) <--> id5((15))
      id3 <--> id5
#+end_example

Entonces podemos proceder a remover el nodo 9.

#+begin_example
  flowchart LR
      
      id1((7)) <--> id2((0)) <--> id3((4)) <--> id5((15))
#+end_example

