Publ/Teoria/DataStruct/LinkedLists.html
<!doctype html>
<html lang="en">
<head>
<title></title>
<!-- 2022-10-08 Sat 18:56 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="J.D Castro">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">

</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Linked lists</a>
<ul class="nav">
<li><a href="#sec-1-1">1.1. Singly &amp; Doubly Linked Lists</a></li>
<li><a href="#sec-1-2">1.2. Detalles de implementación</a></li>
<li><a href="#sec-1-3">1.3. Analisis de complejidad</a></li>
<li><a href="#sec-1-4">1.4. Implementación en código</a></li>
</ul>
</li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title"></h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Linked lists</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Singly &amp; Doubly Linked Lists</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> ¿Que es una lista enlazada (linked list)?</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Una lista enlazada es una lista sequencial de nodos que tienen datos que
apuntan a otros nodos que también contienen datos.
</p>

<p>
TODO: arreglar diagramas
</p>
<pre class="example">
  graph LR
      id1([Data]) --&gt; id2([Data]) --&gt; id3([Data]) --&gt; id4([Data]) --&gt; id5([Null]) 
</pre>
</div>
</div>

<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> ¿Donde son usadas?</h4>
<div class="outline-text-4" id="text-1-1-2">
<ul class="org-ul">
<li>Mayoritariamente en listas, colas &amp; pilas.
</li>
<li>Para crear listas circulares.
</li>
<li>Pueden modelar objetos del mundo real como trenes.
</li>
<li>Usadas en encadenamiento separado (<i>Separate chaining</i>), que están
presentes en en algunas implementaciónes de de tablas hash para evitar
las colisiones hash.
</li>
<li>Usadas a veces en la implementación de listas de proximidad para
grafos.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> Terminologia</h4>
</div>
<div id="outline-container-sec-1-1-4" class="outline-4">
<h4 id="sec-1-1-4"><span class="section-number-4">1.1.4</span> Singliy linked vs. Doubly Linked</h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
Con Singly linked nos referimos a que cada nodo solo tiene una
referencia al siguiente nodo. En la implementación siempre se mantiene
una referencia de la Head y de la Tail para hacer más rápido el agregar
o remover elementos.
</p>

<pre class="example">
  graph LR 
      3--&gt;84--&gt;85--&gt;21--&gt;29--&gt;44--&gt;30
</pre>

<p>
Con una Doubly linked list, cada nodo mantiene una referencia al
siguiente y al nodo anterior. En la implementación siempre se mantiene
una referencia a Head y Tail de toda la lista para hacer más rápido el
agregar o remover elementos de ambos lados de la lista.
</p>

<pre class="example">
  flowchart LR 
      3 &lt;--&gt; 84
      84 &lt;--&gt; 85
      85 &lt;--&gt; 21
      21 &lt;--&gt; 29
      29 &lt;--&gt; 44&lt;--&gt;30
</pre>
</div>
</div>

<div id="outline-container-sec-1-1-5" class="outline-4">
<h4 id="sec-1-1-5"><span class="section-number-4">1.1.5</span> Pros and Cons</h4>
<div class="outline-text-4" id="text-1-1-5">
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-left">&#xa0;</th>
<th scope="col" class="text-left">Pros</th>
<th scope="col" class="text-left">Cons</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-left">Singly Linked</td>
<td class="text-left">Usa menos menoria Implementación más simple</td>
<td class="text-left">No puedes ver fácilmente elementos previos</td>
</tr>

<tr>
<td class="text-left">Doubly Linked</td>
<td class="text-left">Puede ser invertida</td>
<td class="text-left">Ocupa el doble de memoria</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Detalles de implementación</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> Insertando en una Singly linked list</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Inserta 11 en el tercer nodo.
</p>

<pre class="example">
  flowchart LR
      id1((5)) --&gt; id2((23)) --&gt; id3((7)) --&gt; id4((13))
</pre>

<ol class="org-ol">
<li>Creamos un puntero que apunte a Head
</li>
<li>Nos posicionamos en un nodo anterior al que queremos cambiar
</li>
<li>Creamos un nuevo nodo que apunte a el nodo que queremos reemplazar
</li>
<li>hacemos que el nodo en que estamos posicionados apunte al nuevo nodo.
</li>
</ol>

<pre class="example">
  graph LR
      subgraph new
      11--&gt;id4((7))
      end 
      id0((5))--&gt;id1((23))--&gt;11
      id4((7))--&gt;id5((13))
</pre>
</div>
</div>

<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> Insertando en una Doubly linked list</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Inserta 11 en el tercer nodo.
</p>

<pre class="example">
  flowchart LR
      id1((5)) &lt;--&gt; id2((23)) &lt;--&gt; id3((7)) &lt;--&gt; id4((13))
</pre>

<ol class="org-ol">
<li>Creamos un puntero que apunte a Head
</li>
<li>Nos posicionamos en un nodo anterior al que queremos cambiar
</li>
<li>Creamos un nuevo nodo que apunte al nodo al que queremos remplazar
</li>
<li>hacemos que el nuevo nodo apunte al siguiente nodo que queremos
remplazar
</li>
<li>hacemos que el nuevo nodo apunte al nodo anterior
</li>
<li>Hacemos que el nodo sigiente al que insertamos apunte hacia el nuevo
nodo
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> Eliminando elementos de una Singly linked list</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
Elimina el 9 de la siguiente SSL
</p>

<pre class="example">
  flowchart LR
      id1((7)) --&gt; id2((0)) --&gt; id3((4)) --&gt; id4((9)) --&gt; id5((15))
</pre>

<ol class="org-ol">
<li>Creamos dos punteros
</li>
</ol>

<pre class="example">
  flowchart LR
      subgraph p1
      id1((7))
      end
      subgraph p2
      id2((0))
      end
      id1((7)) --&gt; id2((0)) --&gt; id3((4)) --&gt; id4((9)) --&gt; id5((15))
</pre>

<p>
Hacemos avanzar nuestros dos punteros hasta una posicion anterior al
nodo que queremos eliminar.
</p>

<pre class="example">
  flowchart LR
      subgraph p1
      id2((0))
      end
      subgraph p2
      id3((4))
      end
      id1((7)) --&gt; id2((0)) --&gt; id3((4)) --&gt; id4((9)) --&gt; id5((15))
</pre>

<p>
Hacemos avanzar el Puntero 2 a un lugar despues de el nodo que queremos
eliminar y el Puntero 1 a un lugar antes.
</p>

<pre class="example">
  flowchart LR
      subgraph p1
      id3((4))
      end
      subgraph p2
      id5((15))
      end
      id1((7)) --&gt; id2((0)) --&gt; id3((4)) --&gt; id4((9)) --&gt; id5((15))
</pre>

<p>
Cambiamos el puntero de nodo siguiente a la posición del puntero 2
</p>

<pre class="example">
  flowchart LR
      subgraph p1
      id3((4))
      end
      subgraph p2
      id5((15))
      end
      id1((7)) --&gt; id2((0)) --&gt; id3((4)) --&gt; id5((15))
      id4((9)) --&gt; id5((15))
</pre>

<p>
entonces eliminamos el nodo que queremos eliminar
</p>

<pre class="example">
  flowchart LR
      subgraph p1
      id3((4))
      end
      subgraph p2
      id5((15))
      end
      id1((7)) --&gt; id2((0)) --&gt; id3((4)) --&gt; id5((15))
</pre>
</div>
</div>

<div id="outline-container-sec-1-2-4" class="outline-4">
<h4 id="sec-1-2-4"><span class="section-number-4">1.2.4</span> Eliminar elementos de una Doubly linked list</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
Elimina el elemento 9 de la siguiente DDL
</p>

<pre class="example">
  flowchart LR
      id1((7)) &lt;--&gt; id2((0)) &lt;--&gt; id3((4)) &lt;--&gt; id4((9)) &lt;--&gt; id5((15))
</pre>

<p>
Creamos nuestro puntero en head.
</p>

<pre class="example">
  flowchart LR
      subgraph P1
      id1
      end
      id1((7)) &lt;--&gt; id2((0)) &lt;--&gt; id3((4)) &lt;--&gt; id4((9)) &lt;--&gt; id5((15))
</pre>

<p>
lo movemos hasta que lleguemos al nodo que se desea eliminar.
</p>

<pre class="example">
  flowchart LR
      subgraph P1
      id4
      end
      id1((7)) &lt;--&gt; id2((0)) &lt;--&gt; id3((4)) &lt;--&gt; id4((9)) &lt;--&gt; id5((15))
</pre>

<p>
Hacemos que el nodo anterior apunte al nodo que le sigue al que queremos
eliminar.
</p>

<pre class="example">
  flowchart LR
      subgraph P1
      id4
      end
      id1((7)) &lt;--&gt; id2((0)) &lt;--&gt; id3((4)) &lt;--&gt; id4((9)) &lt;--&gt; id5((15))
      id3 --&gt; id5
</pre>

<p>
Luego hacemos que el puntero de 15 apunte a 4.
</p>

<pre class="example">
  flowchart LR
      subgraph P1
      id4
      end
      id1((7)) &lt;--&gt; id2((0)) &lt;--&gt; id3((4)) &lt;--&gt; id4((9)) &lt;--&gt; id5((15))
      id3 &lt;--&gt; id5
</pre>

<p>
Entonces podemos proceder a remover el nodo 9.
</p>

<pre class="example">
  flowchart LR
      
      id1((7)) &lt;--&gt; id2((0)) &lt;--&gt; id3((4)) &lt;--&gt; id5((15))
</pre>
</div>
</div>
</div>
