Files/Teoria/DataStruct/LinkedLists.org
** Analisis de complejidad
|                  | Singly Linked | Doubly linked |
|------------------+---------------+---------------|
| Search           | $`O(n)`$      | $`O(n)`$      |
| Insert at Head   | $`O(1)`$      | $`O(1)`$      |
| Insert at Tail   | $`O(1)`$      | $`O(1)`$      |
| Remove at Head   | $`O(1)`$      | $`O(1)`$      |
| Remove at Tail   | $`O(n)`$      | $`O(1)`$      |
| Remove in middle | $`O(n)`$      | $`O(n)`$      |

