Publ/Teoria/DataStruct/LinkedLists.html

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Analisis de complejidad</h3>
<div class="outline-text-3" id="text-1-3">
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-left">&#xa0;</th>
<th scope="col" class="text-left">Singly Linked</th>
<th scope="col" class="text-left">Doubly linked</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-left">Search</td>
<td class="text-left">\(`O(n)`\)</td>
<td class="text-left">\(`O(n)`\)</td>
</tr>

<tr>
<td class="text-left">Insert at Head</td>
<td class="text-left">\(`O(1)`\)</td>
<td class="text-left">\(`O(1)`\)</td>
</tr>

<tr>
<td class="text-left">Insert at Tail</td>
<td class="text-left">\(`O(1)`\)</td>
<td class="text-left">\(`O(1)`\)</td>
</tr>

<tr>
<td class="text-left">Remove at Head</td>
<td class="text-left">\(`O(1)`\)</td>
<td class="text-left">\(`O(1)`\)</td>
</tr>

<tr>
<td class="text-left">Remove at Tail</td>
<td class="text-left">\(`O(n)`\)</td>
<td class="text-left">\(`O(1)`\)</td>
</tr>

<tr>
<td class="text-left">Remove in middle</td>
<td class="text-left">\(`O(n)`\)</td>
<td class="text-left">\(`O(n)`\)</td>
</tr>
</tbody>
</table>
</div>
</div>
