Publ/Teoria/DataStruct/LinkedLists.html

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Implementación en código</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">

<pre class="src src-java">  <span style="color: #6272a4; font-style: italic;">/**</span>
<span style="color: #6272a4; font-style: italic;">   * A doubly linked list implementation.</span>
<span style="color: #6272a4; font-style: italic;">   *</span>
<span style="color: #6272a4; font-style: italic;">   * @author William Fiset, william.alexandre.fiset@gmail.com</span>
<span style="color: #6272a4; font-style: italic;">   */</span>
  <span style="color: #ff79c6; font-style: italic;">package</span> com.williamfiset.algorithms.datastructures.linkedlist;

  <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #ff79c6; font-style: italic;">class</span> <span style="color: #bd93f9;">DoublyLinkedList</span><span style="color: #61bfff;">&lt;</span><span style="color: #bd93f9;">T</span><span style="color: #61bfff;">&gt;</span> <span style="color: #ff79c6; font-style: italic;">implements</span> <span style="color: #bd93f9;">Iterable</span><span style="color: #61bfff;">&lt;</span><span style="color: #bd93f9;">T</span><span style="color: #61bfff;">&gt;</span> <span style="color: #61bfff;">{</span>
    <span style="color: #ff79c6; font-style: italic;">private</span> <span style="color: #ffb86c;">int</span> size = <span style="color: #8be9fd;">0</span>;
    <span style="color: #ff79c6; font-style: italic;">private</span> <span style="color: #bd93f9;">Node</span><span style="color: #ff79c6;">&lt;</span><span style="color: #bd93f9;">T</span><span style="color: #ff79c6;">&gt;</span> head = <span style="color: #ffb86c;">null</span>;
    <span style="color: #ff79c6; font-style: italic;">private</span> <span style="color: #bd93f9;">Node</span><span style="color: #ff79c6;">&lt;</span><span style="color: #bd93f9;">T</span><span style="color: #ff79c6;">&gt;</span> tail = <span style="color: #ffb86c;">null</span>;

    <span style="color: #6272a4; font-style: italic;">// Internal node class to represent data</span>
    <span style="color: #ff79c6; font-style: italic;">private</span> <span style="color: #ff79c6; font-style: italic;">static</span> <span style="color: #ff79c6; font-style: italic;">class</span> <span style="color: #bd93f9;">Node</span><span style="color: #ff79c6;">&lt;</span><span style="color: #bd93f9;">T</span><span style="color: #ff79c6;">&gt;</span> <span style="color: #ff79c6;">{</span>
      <span style="color: #ff79c6; font-style: italic;">private</span> <span style="color: #bd93f9;">T</span> data;
      <span style="color: #ff79c6; font-style: italic;">private</span> <span style="color: #bd93f9;">Node</span><span style="color: #50fa7b;">&lt;</span><span style="color: #bd93f9;">T</span><span style="color: #50fa7b;">&gt;</span> prev, next;

      <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #bd93f9;">Node</span><span style="color: #50fa7b;">(</span><span style="color: #bd93f9;">T</span> data, <span style="color: #bd93f9;">Node</span><span style="color: #bd93f9;">&lt;</span><span style="color: #bd93f9;">T</span><span style="color: #bd93f9;">&gt;</span> prev, <span style="color: #bd93f9;">Node</span><span style="color: #bd93f9;">&lt;</span><span style="color: #bd93f9;">T</span><span style="color: #bd93f9;">&gt;</span> next<span style="color: #50fa7b;">)</span> <span style="color: #50fa7b;">{</span>
        <span style="color: #ffb86c;">this</span>.data = data;
        <span style="color: #ffb86c;">this</span>.prev = prev;
        <span style="color: #ffb86c;">this</span>.next = next;
      <span style="color: #50fa7b;">}</span>

      <span style="color: #ff79c6; font-style: italic;">@</span><span style="color: #bd93f9; font-weight: bold;">Override</span>
      <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #bd93f9;">String</span> <span style="color: #50fa7b;">toString</span><span style="color: #50fa7b;">()</span> <span style="color: #50fa7b;">{</span>
        <span style="color: #ff79c6; font-style: italic;">return</span> data.<span style="color: #50fa7b;">toString</span><span style="color: #bd93f9;">()</span>;
      <span style="color: #50fa7b;">}</span>
    <span style="color: #ff79c6;">}</span>

    <span style="color: #6272a4; font-style: italic;">// Empty this linked list, O(n)</span>
    <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #ffb86c;">void</span> <span style="color: #50fa7b;">clear</span><span style="color: #ff79c6;">()</span> <span style="color: #ff79c6;">{</span>
      <span style="color: #bd93f9;">Node</span><span style="color: #50fa7b;">&lt;</span><span style="color: #bd93f9;">T</span><span style="color: #50fa7b;">&gt;</span> trav = head;
      <span style="color: #ff79c6; font-style: italic;">while</span> <span style="color: #50fa7b;">(</span>trav != <span style="color: #ffb86c;">null</span><span style="color: #50fa7b;">)</span> <span style="color: #50fa7b;">{</span>
        <span style="color: #bd93f9;">Node</span><span style="color: #bd93f9;">&lt;</span><span style="color: #bd93f9;">T</span><span style="color: #bd93f9;">&gt;</span> next = trav.next;
        trav.prev = trav.next = <span style="color: #ffb86c;">null</span>;
        trav.data = <span style="color: #ffb86c;">null</span>;
        trav = next;
      <span style="color: #50fa7b;">}</span>
      head = tail = trav = <span style="color: #ffb86c;">null</span>;
      size = <span style="color: #8be9fd;">0</span>;
    <span style="color: #ff79c6;">}</span>

    <span style="color: #6272a4; font-style: italic;">// Return the size of this linked list</span>
    <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #ffb86c;">int</span> <span style="color: #50fa7b;">size</span><span style="color: #ff79c6;">()</span> <span style="color: #ff79c6;">{</span>
      <span style="color: #ff79c6; font-style: italic;">return</span> size;
    <span style="color: #ff79c6;">}</span>

    <span style="color: #6272a4; font-style: italic;">// Is this linked list empty?</span>
    <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #ffb86c;">boolean</span> <span style="color: #50fa7b;">isEmpty</span><span style="color: #ff79c6;">()</span> <span style="color: #ff79c6;">{</span>
      <span style="color: #ff79c6; font-style: italic;">return</span> <span style="color: #50fa7b;">size</span><span style="color: #50fa7b;">()</span> == <span style="color: #8be9fd;">0</span>;
    <span style="color: #ff79c6;">}</span>

    <span style="color: #6272a4; font-style: italic;">// Add an element to the tail of the linked list, O(1)</span>
    <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #ffb86c;">void</span> <span style="color: #50fa7b;">add</span><span style="color: #ff79c6;">(</span><span style="color: #bd93f9;">T</span> elem<span style="color: #ff79c6;">)</span> <span style="color: #ff79c6;">{</span>
      <span style="color: #50fa7b;">addLast</span><span style="color: #50fa7b;">(</span>elem<span style="color: #50fa7b;">)</span>;
    <span style="color: #ff79c6;">}</span>

    <span style="color: #6272a4; font-style: italic;">// Add a node to the tail of the linked list, O(1)</span>
    <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #ffb86c;">void</span> <span style="color: #50fa7b;">addLast</span><span style="color: #ff79c6;">(</span><span style="color: #bd93f9;">T</span> elem<span style="color: #ff79c6;">)</span> <span style="color: #ff79c6;">{</span>
      <span style="color: #ff79c6; font-style: italic;">if</span> <span style="color: #50fa7b;">(</span><span style="color: #50fa7b;">isEmpty</span><span style="color: #bd93f9;">()</span><span style="color: #50fa7b;">)</span> <span style="color: #50fa7b;">{</span>
        head = tail = <span style="color: #ff79c6; font-style: italic;">new</span> <span style="color: #bd93f9;">Node</span><span style="color: #bd93f9;">&lt;</span><span style="color: #bd93f9;">T</span><span style="color: #bd93f9;">&gt;(</span>elem, <span style="color: #ffb86c;">null</span>, <span style="color: #ffb86c;">null</span><span style="color: #bd93f9;">)</span>;
      <span style="color: #50fa7b;">}</span> <span style="color: #ff79c6; font-style: italic;">else</span> <span style="color: #50fa7b;">{</span>
        tail.next = <span style="color: #ff79c6; font-style: italic;">new</span> <span style="color: #bd93f9;">Node</span><span style="color: #bd93f9;">&lt;</span><span style="color: #bd93f9;">T</span><span style="color: #bd93f9;">&gt;(</span>elem, tail, <span style="color: #ffb86c;">null</span><span style="color: #bd93f9;">)</span>;
        tail = tail.next;
      <span style="color: #50fa7b;">}</span>
      size++;
    <span style="color: #ff79c6;">}</span>

    <span style="color: #6272a4; font-style: italic;">// Add an element to the beginning of this linked list, O(1)</span>
    <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #ffb86c;">void</span> <span style="color: #50fa7b;">addFirst</span><span style="color: #ff79c6;">(</span><span style="color: #bd93f9;">T</span> elem<span style="color: #ff79c6;">)</span> <span style="color: #ff79c6;">{</span>
      <span style="color: #ff79c6; font-style: italic;">if</span> <span style="color: #50fa7b;">(</span><span style="color: #50fa7b;">isEmpty</span><span style="color: #bd93f9;">()</span><span style="color: #50fa7b;">)</span> <span style="color: #50fa7b;">{</span>
        head = tail = <span style="color: #ff79c6; font-style: italic;">new</span> <span style="color: #bd93f9;">Node</span><span style="color: #bd93f9;">&lt;</span><span style="color: #bd93f9;">T</span><span style="color: #bd93f9;">&gt;(</span>elem, <span style="color: #ffb86c;">null</span>, <span style="color: #ffb86c;">null</span><span style="color: #bd93f9;">)</span>;
      <span style="color: #50fa7b;">}</span> <span style="color: #ff79c6; font-style: italic;">else</span> <span style="color: #50fa7b;">{</span>
        head.prev = <span style="color: #ff79c6; font-style: italic;">new</span> <span style="color: #bd93f9;">Node</span><span style="color: #bd93f9;">&lt;</span><span style="color: #bd93f9;">T</span><span style="color: #bd93f9;">&gt;(</span>elem, <span style="color: #ffb86c;">null</span>, head<span style="color: #bd93f9;">)</span>;
        head = head.prev;
      <span style="color: #50fa7b;">}</span>
      size++;
    <span style="color: #ff79c6;">}</span>

    <span style="color: #6272a4; font-style: italic;">// Add an element at a specified index</span>
    <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #ffb86c;">void</span> <span style="color: #50fa7b;">addAt</span><span style="color: #ff79c6;">(</span><span style="color: #ffb86c;">int</span> index, <span style="color: #bd93f9;">T</span> data<span style="color: #ff79c6;">)</span> <span style="color: #ff79c6; font-style: italic;">throws</span> <span style="color: #bd93f9;">Exception</span> <span style="color: #ff79c6;">{</span>
      <span style="color: #ff79c6; font-style: italic;">if</span> <span style="color: #50fa7b;">(</span>index &lt; <span style="color: #8be9fd;">0</span><span style="color: #50fa7b;">)</span> <span style="color: #50fa7b;">{</span>
        <span style="color: #ff79c6; font-style: italic;">throw</span> <span style="color: #ff79c6; font-style: italic;">new</span> <span style="color: #bd93f9;">Exception</span><span style="color: #bd93f9;">(</span><span style="color: #f1fa8c;">"Illegal Index"</span><span style="color: #bd93f9;">)</span>;
      <span style="color: #50fa7b;">}</span>
      <span style="color: #ff79c6; font-style: italic;">if</span> <span style="color: #50fa7b;">(</span>index == <span style="color: #8be9fd;">0</span><span style="color: #50fa7b;">)</span> <span style="color: #50fa7b;">{</span>
        <span style="color: #50fa7b;">addFirst</span><span style="color: #bd93f9;">(</span>data<span style="color: #bd93f9;">)</span>;
        <span style="color: #ff79c6; font-style: italic;">return</span>;
      <span style="color: #50fa7b;">}</span>

      <span style="color: #ff79c6; font-style: italic;">if</span> <span style="color: #50fa7b;">(</span>index == size<span style="color: #50fa7b;">)</span> <span style="color: #50fa7b;">{</span>
        <span style="color: #50fa7b;">addLast</span><span style="color: #bd93f9;">(</span>data<span style="color: #bd93f9;">)</span>;
        <span style="color: #ff79c6; font-style: italic;">return</span>;
      <span style="color: #50fa7b;">}</span>

      <span style="color: #bd93f9;">Node</span><span style="color: #50fa7b;">&lt;</span><span style="color: #bd93f9;">T</span><span style="color: #50fa7b;">&gt;</span> temp = head;
      <span style="color: #ff79c6; font-style: italic;">for</span> <span style="color: #50fa7b;">(</span><span style="color: #ffb86c;">int</span> i = <span style="color: #8be9fd;">0</span>; i &lt; index - <span style="color: #8be9fd;">1</span>; i++<span style="color: #50fa7b;">)</span> <span style="color: #50fa7b;">{</span>
        temp = temp.next;
      <span style="color: #50fa7b;">}</span>
      <span style="color: #bd93f9;">Node</span><span style="color: #50fa7b;">&lt;</span><span style="color: #bd93f9;">T</span><span style="color: #50fa7b;">&gt;</span> newNode = <span style="color: #ff79c6; font-style: italic;">new</span> <span style="color: #bd93f9;">Node</span><span style="color: #50fa7b;">&lt;&gt;(</span>data, temp, temp.next<span style="color: #50fa7b;">)</span>;
      temp.next.prev = newNode;
      temp.next = newNode;

      size++;
    <span style="color: #ff79c6;">}</span>

    <span style="color: #6272a4; font-style: italic;">// Check the value of the first node if it exists, O(1)</span>
    <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #bd93f9;">T</span> <span style="color: #50fa7b;">peekFirst</span><span style="color: #ff79c6;">()</span> <span style="color: #ff79c6;">{</span>
      <span style="color: #ff79c6; font-style: italic;">if</span> <span style="color: #50fa7b;">(</span><span style="color: #50fa7b;">isEmpty</span><span style="color: #bd93f9;">()</span><span style="color: #50fa7b;">)</span> <span style="color: #ff79c6; font-style: italic;">throw</span> <span style="color: #ff79c6; font-style: italic;">new</span> <span style="color: #bd93f9;">RuntimeException</span><span style="color: #50fa7b;">(</span><span style="color: #f1fa8c;">"Empty list"</span><span style="color: #50fa7b;">)</span>;
      <span style="color: #ff79c6; font-style: italic;">return</span> head.data;
    <span style="color: #ff79c6;">}</span>

    <span style="color: #6272a4; font-style: italic;">// Check the value of the last node if it exists, O(1)</span>
    <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #bd93f9;">T</span> <span style="color: #50fa7b;">peekLast</span><span style="color: #ff79c6;">()</span> <span style="color: #ff79c6;">{</span>
      <span style="color: #ff79c6; font-style: italic;">if</span> <span style="color: #50fa7b;">(</span><span style="color: #50fa7b;">isEmpty</span><span style="color: #bd93f9;">()</span><span style="color: #50fa7b;">)</span> <span style="color: #ff79c6; font-style: italic;">throw</span> <span style="color: #ff79c6; font-style: italic;">new</span> <span style="color: #bd93f9;">RuntimeException</span><span style="color: #50fa7b;">(</span><span style="color: #f1fa8c;">"Empty list"</span><span style="color: #50fa7b;">)</span>;
      <span style="color: #ff79c6; font-style: italic;">return</span> tail.data;
    <span style="color: #ff79c6;">}</span>

    <span style="color: #6272a4; font-style: italic;">// Remove the first value at the head of the linked list, O(1)</span>
    <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #bd93f9;">T</span> <span style="color: #50fa7b;">removeFirst</span><span style="color: #ff79c6;">()</span> <span style="color: #ff79c6;">{</span>
      <span style="color: #6272a4; font-style: italic;">// Can't remove data from an empty list</span>
      <span style="color: #ff79c6; font-style: italic;">if</span> <span style="color: #50fa7b;">(</span><span style="color: #50fa7b;">isEmpty</span><span style="color: #bd93f9;">()</span><span style="color: #50fa7b;">)</span> <span style="color: #ff79c6; font-style: italic;">throw</span> <span style="color: #ff79c6; font-style: italic;">new</span> <span style="color: #bd93f9;">RuntimeException</span><span style="color: #50fa7b;">(</span><span style="color: #f1fa8c;">"Empty list"</span><span style="color: #50fa7b;">)</span>;

      <span style="color: #6272a4; font-style: italic;">// Extract the data at the head and move</span>
      <span style="color: #6272a4; font-style: italic;">// the head pointer forwards one node</span>
      <span style="color: #bd93f9;">T</span> data = head.data;
      head = head.next;
      --size;

      <span style="color: #6272a4; font-style: italic;">// If the list is empty set the tail to null</span>
      <span style="color: #ff79c6; font-style: italic;">if</span> <span style="color: #50fa7b;">(</span><span style="color: #50fa7b;">isEmpty</span><span style="color: #bd93f9;">()</span><span style="color: #50fa7b;">)</span> tail = <span style="color: #ffb86c;">null</span>;

      <span style="color: #6272a4; font-style: italic;">// Do a memory cleanup of the previous node</span>
      <span style="color: #ff79c6; font-style: italic;">else</span> head.prev = <span style="color: #ffb86c;">null</span>;

      <span style="color: #6272a4; font-style: italic;">// Return the data that was at the first node we just removed</span>
      <span style="color: #ff79c6; font-style: italic;">return</span> data;
    <span style="color: #ff79c6;">}</span>

    <span style="color: #6272a4; font-style: italic;">// Remove the last value at the tail of the linked list, O(1)</span>
    <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #bd93f9;">T</span> <span style="color: #50fa7b;">removeLast</span><span style="color: #ff79c6;">()</span> <span style="color: #ff79c6;">{</span>
      <span style="color: #6272a4; font-style: italic;">// Can't remove data from an empty list</span>
      <span style="color: #ff79c6; font-style: italic;">if</span> <span style="color: #50fa7b;">(</span><span style="color: #50fa7b;">isEmpty</span><span style="color: #bd93f9;">()</span><span style="color: #50fa7b;">)</span> <span style="color: #ff79c6; font-style: italic;">throw</span> <span style="color: #ff79c6; font-style: italic;">new</span> <span style="color: #bd93f9;">RuntimeException</span><span style="color: #50fa7b;">(</span><span style="color: #f1fa8c;">"Empty list"</span><span style="color: #50fa7b;">)</span>;

      <span style="color: #6272a4; font-style: italic;">// Extract the data at the tail and move</span>
      <span style="color: #6272a4; font-style: italic;">// the tail pointer backwards one node</span>
      <span style="color: #bd93f9;">T</span> data = tail.data;
      tail = tail.prev;
      --size;

      <span style="color: #6272a4; font-style: italic;">// If the list is now empty set the head to null</span>
      <span style="color: #ff79c6; font-style: italic;">if</span> <span style="color: #50fa7b;">(</span><span style="color: #50fa7b;">isEmpty</span><span style="color: #bd93f9;">()</span><span style="color: #50fa7b;">)</span> head = <span style="color: #ffb86c;">null</span>;

      <span style="color: #6272a4; font-style: italic;">// Do a memory clean of the node that was just removed</span>
      <span style="color: #ff79c6; font-style: italic;">else</span> tail.next = <span style="color: #ffb86c;">null</span>;

      <span style="color: #6272a4; font-style: italic;">// Return the data that was in the last node we just removed</span>
      <span style="color: #ff79c6; font-style: italic;">return</span> data;
    <span style="color: #ff79c6;">}</span>

    <span style="color: #6272a4; font-style: italic;">// Remove an arbitrary node from the linked list, O(1)</span>
    <span style="color: #ff79c6; font-style: italic;">private</span> <span style="color: #bd93f9;">T</span> <span style="color: #50fa7b;">remove</span><span style="color: #ff79c6;">(</span><span style="color: #bd93f9;">Node</span><span style="color: #50fa7b;">&lt;</span><span style="color: #bd93f9;">T</span><span style="color: #50fa7b;">&gt;</span> node<span style="color: #ff79c6;">)</span> <span style="color: #ff79c6;">{</span>
      <span style="color: #6272a4; font-style: italic;">// If the node to remove is somewhere either at the</span>
      <span style="color: #6272a4; font-style: italic;">// head or the tail handle those independently</span>
      <span style="color: #ff79c6; font-style: italic;">if</span> <span style="color: #50fa7b;">(</span>node.prev == <span style="color: #ffb86c;">null</span><span style="color: #50fa7b;">)</span> <span style="color: #ff79c6; font-style: italic;">return</span> <span style="color: #50fa7b;">removeFirst</span><span style="color: #50fa7b;">()</span>;
      <span style="color: #ff79c6; font-style: italic;">if</span><span style="color: #50fa7b;">(</span>node.next == <span style="color: #ffb86c;">null</span><span style="color: #50fa7b;">)</span> <span style="color: #ff79c6; font-style: italic;">return</span> <span style="color: #50fa7b;">removeLast</span><span style="color: #50fa7b;">()</span>;

      <span style="color: #6272a4; font-style: italic;">// Make the pointers of adjacent nodes skip over 'node'</span>
      node.next.prev = node.prev;
      node.prev.next = node.next;

      <span style="color: #6272a4; font-style: italic;">// Temporarily store the data we want to return</span>
      <span style="color: #bd93f9;">T</span> data = node.data;

      <span style="color: #6272a4; font-style: italic;">// Memory cleanup</span>
      node.data = <span style="color: #ffb86c;">null</span>;
      node = node.prev = node.next = <span style="color: #ffb86c;">null</span>;

      --size;

      <span style="color: #6272a4; font-style: italic;">// Return the data in the node we just removed</span>
      <span style="color: #ff79c6; font-style: italic;">return</span> data;
    <span style="color: #ff79c6;">}</span>

    <span style="color: #6272a4; font-style: italic;">// Remove a node at a particular index, O(n)</span>
    <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #bd93f9;">T</span> <span style="color: #50fa7b;">removeAt</span><span style="color: #ff79c6;">(</span><span style="color: #ffb86c;">int</span> index<span style="color: #ff79c6;">)</span> <span style="color: #ff79c6;">{</span>
      <span style="color: #6272a4; font-style: italic;">// Make sure the index provided is valid</span>
      <span style="color: #ff79c6; font-style: italic;">if</span> <span style="color: #50fa7b;">(</span>index &lt; <span style="color: #8be9fd;">0</span> || index &gt;= size<span style="color: #50fa7b;">)</span> <span style="color: #50fa7b;">{</span>
        <span style="color: #ff79c6; font-style: italic;">throw</span> <span style="color: #ff79c6; font-style: italic;">new</span> <span style="color: #bd93f9;">IllegalArgumentException</span><span style="color: #bd93f9;">()</span>;
      <span style="color: #50fa7b;">}</span>

      <span style="color: #ffb86c;">int</span> i;
      <span style="color: #bd93f9;">Node</span><span style="color: #50fa7b;">&lt;</span><span style="color: #bd93f9;">T</span><span style="color: #50fa7b;">&gt;</span> trav;

      <span style="color: #6272a4; font-style: italic;">// Search from the front of the list</span>
      <span style="color: #ff79c6; font-style: italic;">if</span> <span style="color: #50fa7b;">(</span>index &lt; size / <span style="color: #8be9fd;">2</span><span style="color: #50fa7b;">)</span> <span style="color: #50fa7b;">{</span>
        <span style="color: #ff79c6; font-style: italic;">for</span> <span style="color: #bd93f9;">(</span>i = <span style="color: #8be9fd;">0</span>, trav = head; i != index; i++<span style="color: #bd93f9;">)</span> <span style="color: #bd93f9;">{</span>
          trav = trav.next;
        <span style="color: #bd93f9;">}</span>
        <span style="color: #6272a4; font-style: italic;">// Search from the back of the list</span>
      <span style="color: #50fa7b;">}</span> <span style="color: #ff79c6; font-style: italic;">else</span>
        <span style="color: #ff79c6; font-style: italic;">for</span> <span style="color: #50fa7b;">(</span>i = size - <span style="color: #8be9fd;">1</span>, trav = tail; i != index; i--<span style="color: #50fa7b;">)</span> <span style="color: #50fa7b;">{</span>
          trav = trav.prev;
        <span style="color: #50fa7b;">}</span>

      <span style="color: #ff79c6; font-style: italic;">return</span> <span style="color: #50fa7b;">remove</span><span style="color: #50fa7b;">(</span>trav<span style="color: #50fa7b;">)</span>;
    <span style="color: #ff79c6;">}</span>

    <span style="color: #6272a4; font-style: italic;">// Remove a particular value in the linked list, O(n)</span>
    <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #ffb86c;">boolean</span> <span style="color: #50fa7b;">remove</span><span style="color: #ff79c6;">(</span><span style="color: #bd93f9;">Object</span> obj<span style="color: #ff79c6;">)</span> <span style="color: #ff79c6;">{</span>
      <span style="color: #bd93f9;">Node</span><span style="color: #50fa7b;">&lt;</span><span style="color: #bd93f9;">T</span><span style="color: #50fa7b;">&gt;</span> trav = head;

      <span style="color: #6272a4; font-style: italic;">// Support searching for null</span>
      <span style="color: #ff79c6; font-style: italic;">if</span> <span style="color: #50fa7b;">(</span>obj == <span style="color: #ffb86c;">null</span><span style="color: #50fa7b;">)</span> <span style="color: #50fa7b;">{</span>
        <span style="color: #ff79c6; font-style: italic;">for</span> <span style="color: #bd93f9;">(</span>trav = head; trav != <span style="color: #ffb86c;">null</span>; trav = trav.next<span style="color: #bd93f9;">)</span> <span style="color: #bd93f9;">{</span>
          <span style="color: #ff79c6; font-style: italic;">if</span> <span style="color: #61bfff;">(</span>trav.data == <span style="color: #ffb86c;">null</span><span style="color: #61bfff;">)</span> <span style="color: #61bfff;">{</span>
            <span style="color: #50fa7b;">remove</span><span style="color: #ff79c6;">(</span>trav<span style="color: #ff79c6;">)</span>;
            <span style="color: #ff79c6; font-style: italic;">return</span> <span style="color: #ffb86c;">true</span>;
          <span style="color: #61bfff;">}</span>
        <span style="color: #bd93f9;">}</span>
        <span style="color: #6272a4; font-style: italic;">// Search for non null object</span>
      <span style="color: #50fa7b;">}</span> <span style="color: #ff79c6; font-style: italic;">else</span> <span style="color: #50fa7b;">{</span>
        <span style="color: #ff79c6; font-style: italic;">for</span> <span style="color: #bd93f9;">(</span>trav = head; trav != <span style="color: #ffb86c;">null</span>; trav = trav.next<span style="color: #bd93f9;">)</span> <span style="color: #bd93f9;">{</span>
          <span style="color: #ff79c6; font-style: italic;">if</span> <span style="color: #61bfff;">(</span>obj.<span style="color: #50fa7b;">equals</span><span style="color: #ff79c6;">(</span>trav.data<span style="color: #ff79c6;">)</span><span style="color: #61bfff;">)</span> <span style="color: #61bfff;">{</span>
            <span style="color: #50fa7b;">remove</span><span style="color: #ff79c6;">(</span>trav<span style="color: #ff79c6;">)</span>;
            <span style="color: #ff79c6; font-style: italic;">return</span> <span style="color: #ffb86c;">true</span>;
          <span style="color: #61bfff;">}</span>
        <span style="color: #bd93f9;">}</span>
      <span style="color: #50fa7b;">}</span>
      <span style="color: #ff79c6; font-style: italic;">return</span> <span style="color: #ffb86c;">false</span>;
    <span style="color: #ff79c6;">}</span>

    <span style="color: #6272a4; font-style: italic;">// Find the index of a particular value in the linked list, O(n)</span>
    <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #ffb86c;">int</span> <span style="color: #50fa7b;">indexOf</span><span style="color: #ff79c6;">(</span><span style="color: #bd93f9;">Object</span> obj<span style="color: #ff79c6;">)</span> <span style="color: #ff79c6;">{</span>
      <span style="color: #ffb86c;">int</span> index = <span style="color: #8be9fd;">0</span>;
      <span style="color: #bd93f9;">Node</span><span style="color: #50fa7b;">&lt;</span><span style="color: #bd93f9;">T</span><span style="color: #50fa7b;">&gt;</span> trav = head;

      <span style="color: #6272a4; font-style: italic;">// Support searching for null</span>
      <span style="color: #ff79c6; font-style: italic;">if</span> <span style="color: #50fa7b;">(</span>obj == <span style="color: #ffb86c;">null</span><span style="color: #50fa7b;">)</span> <span style="color: #50fa7b;">{</span>
        <span style="color: #ff79c6; font-style: italic;">for</span> <span style="color: #bd93f9;">(</span>; trav != <span style="color: #ffb86c;">null</span>; trav = trav.next, index++<span style="color: #bd93f9;">)</span> <span style="color: #bd93f9;">{</span>
          <span style="color: #ff79c6; font-style: italic;">if</span> <span style="color: #61bfff;">(</span>trav.data == <span style="color: #ffb86c;">null</span><span style="color: #61bfff;">)</span> <span style="color: #61bfff;">{</span>
            <span style="color: #ff79c6; font-style: italic;">return</span> index;
          <span style="color: #61bfff;">}</span>
        <span style="color: #bd93f9;">}</span>
        <span style="color: #6272a4; font-style: italic;">// Search for non null object</span>
      <span style="color: #50fa7b;">}</span> <span style="color: #ff79c6; font-style: italic;">else</span>
        <span style="color: #ff79c6; font-style: italic;">for</span> <span style="color: #50fa7b;">(</span>; trav != <span style="color: #ffb86c;">null</span>; trav = trav.next, index++<span style="color: #50fa7b;">)</span> <span style="color: #50fa7b;">{</span>
          <span style="color: #ff79c6; font-style: italic;">if</span> <span style="color: #bd93f9;">(</span>obj.<span style="color: #50fa7b;">equals</span><span style="color: #61bfff;">(</span>trav.data<span style="color: #61bfff;">)</span><span style="color: #bd93f9;">)</span> <span style="color: #bd93f9;">{</span>
            <span style="color: #ff79c6; font-style: italic;">return</span> index;
          <span style="color: #bd93f9;">}</span>
        <span style="color: #50fa7b;">}</span>

      <span style="color: #ff79c6; font-style: italic;">return</span> -<span style="color: #8be9fd;">1</span>;
    <span style="color: #ff79c6;">}</span>

    <span style="color: #6272a4; font-style: italic;">// Check is a value is contained within the linked list</span>
    <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #ffb86c;">boolean</span> <span style="color: #50fa7b;">contains</span><span style="color: #ff79c6;">(</span><span style="color: #bd93f9;">Object</span> obj<span style="color: #ff79c6;">)</span> <span style="color: #ff79c6;">{</span>
      <span style="color: #ff79c6; font-style: italic;">return</span> <span style="color: #50fa7b;">indexOf</span><span style="color: #50fa7b;">(</span>obj<span style="color: #50fa7b;">)</span> != -<span style="color: #8be9fd;">1</span>;
    <span style="color: #ff79c6;">}</span>

    <span style="color: #ff79c6; font-style: italic;">@</span><span style="color: #bd93f9; font-weight: bold;">Override</span>
    <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #bd93f9;">java</span>.<span style="color: #bd93f9;">util</span>.<span style="color: #bd93f9;">Iterator</span><span style="color: #ff79c6;">&lt;</span><span style="color: #bd93f9;">T</span><span style="color: #ff79c6;">&gt;</span> <span style="color: #50fa7b;">iterator</span><span style="color: #ff79c6;">()</span> <span style="color: #ff79c6;">{</span>
      <span style="color: #ff79c6; font-style: italic;">return</span> <span style="color: #ff79c6; font-style: italic;">new</span> <span style="color: #bd93f9;">java</span>.<span style="color: #bd93f9;">util</span>.<span style="color: #bd93f9;">Iterator</span><span style="color: #50fa7b;">&lt;</span><span style="color: #bd93f9;">T</span><span style="color: #50fa7b;">&gt;()</span> <span style="color: #50fa7b;">{</span>
        <span style="color: #ff79c6; font-style: italic;">private</span> <span style="color: #bd93f9;">Node</span><span style="color: #bd93f9;">&lt;</span><span style="color: #bd93f9;">T</span><span style="color: #bd93f9;">&gt;</span> trav = head;

        <span style="color: #ff79c6; font-style: italic;">@</span><span style="color: #bd93f9; font-weight: bold;">Override</span>
        <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #ffb86c;">boolean</span> <span style="color: #50fa7b;">hasNext</span><span style="color: #bd93f9;">()</span> <span style="color: #bd93f9;">{</span>
          <span style="color: #ff79c6; font-style: italic;">return</span> trav != <span style="color: #ffb86c;">null</span>;
        <span style="color: #bd93f9;">}</span>

        <span style="color: #ff79c6; font-style: italic;">@</span><span style="color: #bd93f9; font-weight: bold;">Override</span>
        <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #bd93f9;">T</span> <span style="color: #50fa7b;">next</span><span style="color: #bd93f9;">()</span> <span style="color: #bd93f9;">{</span>
          <span style="color: #bd93f9;">T</span> data = trav.data;
          trav = trav.next;
          <span style="color: #ff79c6; font-style: italic;">return</span> data;
        <span style="color: #bd93f9;">}</span>

        <span style="color: #ff79c6; font-style: italic;">@</span><span style="color: #bd93f9; font-weight: bold;">Override</span>
        <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #ffb86c;">void</span> <span style="color: #50fa7b;">remove</span><span style="color: #bd93f9;">()</span> <span style="color: #bd93f9;">{</span>
          <span style="color: #ff79c6; font-style: italic;">throw</span> <span style="color: #ff79c6; font-style: italic;">new</span> <span style="color: #bd93f9;">UnsupportedOperationException</span><span style="color: #61bfff;">()</span>;
        <span style="color: #bd93f9;">}</span>
      <span style="color: #50fa7b;">}</span>;
    <span style="color: #ff79c6;">}</span>

    <span style="color: #ff79c6; font-style: italic;">@</span><span style="color: #bd93f9; font-weight: bold;">Override</span>
    <span style="color: #ff79c6; font-style: italic;">public</span> <span style="color: #bd93f9;">String</span> <span style="color: #50fa7b;">toString</span><span style="color: #ff79c6;">()</span> <span style="color: #ff79c6;">{</span>
      <span style="color: #bd93f9;">StringBuilder</span> sb = <span style="color: #ff79c6; font-style: italic;">new</span> <span style="color: #bd93f9;">StringBuilder</span><span style="color: #50fa7b;">()</span>;
      sb.<span style="color: #50fa7b;">append</span><span style="color: #50fa7b;">(</span><span style="color: #f1fa8c;">"[ "</span><span style="color: #50fa7b;">)</span>;
      <span style="color: #bd93f9;">Node</span><span style="color: #50fa7b;">&lt;</span><span style="color: #bd93f9;">T</span><span style="color: #50fa7b;">&gt;</span> trav = head;
      <span style="color: #ff79c6; font-style: italic;">while</span> <span style="color: #50fa7b;">(</span>trav != <span style="color: #ffb86c;">null</span><span style="color: #50fa7b;">)</span> <span style="color: #50fa7b;">{</span>
        sb.<span style="color: #50fa7b;">append</span><span style="color: #bd93f9;">(</span>trav.data<span style="color: #bd93f9;">)</span>;
        <span style="color: #ff79c6; font-style: italic;">if</span> <span style="color: #bd93f9;">(</span>trav.next != <span style="color: #ffb86c;">null</span><span style="color: #bd93f9;">)</span> <span style="color: #bd93f9;">{</span>
          sb.<span style="color: #50fa7b;">append</span><span style="color: #61bfff;">(</span><span style="color: #f1fa8c;">", "</span><span style="color: #61bfff;">)</span>;
        <span style="color: #bd93f9;">}</span>
        trav = trav.next;
      <span style="color: #50fa7b;">}</span>
      sb.<span style="color: #50fa7b;">append</span><span style="color: #50fa7b;">(</span><span style="color: #f1fa8c;">" ]"</span><span style="color: #50fa7b;">)</span>;
      <span style="color: #ff79c6; font-style: italic;">return</span> sb.<span style="color: #50fa7b;">toString</span><span style="color: #50fa7b;">()</span>;
    <span style="color: #ff79c6;">}</span>
  <span style="color: #61bfff;">}</span> 
</pre>
</div>
</div>
</div>
</div>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: J.D Castro</p>
<p class="date">Created: 2022-10-08 Sat 18:56</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 28.1.50 (<a href="http://orgmode.org">Org-mode</a> 9.6)</p>
</div>
</footer>
</body>
</html>
